Autodesk.Revit.DB.DirectContext3D.PrimitiveType
Type of geometry primitive represented as a number.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.PrimitiveType.PointList
Geometry consisting of a list of points.

Autodesk.Revit.DB.DirectContext3D.PrimitiveType.LineList
Geometry consisting of a list of line segments.

Autodesk.Revit.DB.DirectContext3D.PrimitiveType.TriangleList
Geometry consisting of a list of triangles.